---
kind: property
id: P:Autodesk.Revit.DB.StructuralAsset.ConcreteShearReinforcement
source: html/9767868d-a835-b364-2574-72065f1852ad.htm
---
# Autodesk.Revit.DB.StructuralAsset.ConcreteShearReinforcement Property

The shear reinforcement of the asset.

## Syntax (C#)
```csharp
public double ConcreteShearReinforcement { get; set; }
```

## Remarks
Applies to concrete-based structural assets.

## Exceptions
- **Autodesk.Revit.Exceptions.InapplicableDataException** - When setting this property: the material type must be concrete to set this property.